miniACS_V1_37/Win/Tr69-Scripts/script.txt

<SOAP-ENV:Envelope xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="SOAP-ENV:Envelope"><SOAP-ENV:Header><cwmp:ID SOAP-ENV:mustUnderstand="1">1340799538045</cwmp:ID></SOAP-ENV:Header><SOAP-ENV:Body><cwmp:GetParameterValues><ParameterNames SOAP-ENC:arrayType="xsd:string[1]"><string>InternetGatewayDevice.VoiceService.1.VoiceProfile.1.Line.</string></ParameterNames></cwmp:GetParameterValues></SOAP-ENV:Body></SOAP-ENV:Envelope>
<SOAP-ENV:Envelope xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="SOAP-ENV:Envelope"><SOAP-ENV:Header><cwmp:ID SOAP-ENV:mustUnderstand="1">1340799538217</cwmp:ID></SOAP-ENV:Header><SOAP-ENV:Body><cwmp:SetParameterValues><ParameterList SOAP-ENC:arrayType="cwmp:ParameterValueStruct[3]"><ParameterValueStruct><Name>InternetGatewayDevice.VoiceService.1.VoiceProfile.1.Enable</Name><Value>Enabled</Value></ParameterValueStruct><ParameterValueStruct><Name>InternetGatewayDevice.VoiceService.1.VoiceProfile.1.SIP.OutboundProxy</Name><Value>sip.alice-voip.de</Value></ParameterValueStruct><ParameterValueStruct><Name>InternetGatewayDevice.VoiceService.1.VoiceProfile.1.SIP.UserAgentDomain</Name><Value>sip.alice-voip.de</Value></ParameterValueStruct></ParameterList><ParameterKey>20745</ParameterKey></cwmp:SetParameterValues></SOAP-ENV:Body></SOAP-ENV:Envelope>
<SOAP-ENV:Envelope xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="SOAP-ENV:Envelope"><SOAP-ENV:Header><cwmp:ID SOAP-ENV:mustUnderstand="1">1340799541341</cwmp:ID></SOAP-ENV:Header><SOAP-ENV:Body><cwmp:AddObject><ObjectName>InternetGatewayDevice.VoiceService.1.VoiceProfile.1.Line.</ObjectName><ParameterKey>20745</ParameterKey></cwmp:AddObject></SOAP-ENV:Body></SOAP-ENV:Envelope>
<SOAP-ENV:Envelope xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="SOAP-ENV:Envelope"><SOAP-ENV:Header><cwmp:ID SOAP-ENV:mustUnderstand="1">1340799544396</cwmp:ID></SOAP-ENV:Header><SOAP-ENV:Body><cwmp:SetParameterValues><ParameterList SOAP-ENC:arrayType="cwmp:ParameterValueStruct[3]"><ParameterValueStruct><Name>InternetGatewayDevice.VoiceService.1.VoiceProfile.1.Line.1.DirectoryNumber</Name><Value>4940519001209/4940</Value></ParameterValueStruct><ParameterValueStruct><Name>InternetGatewayDevice.VoiceService.1.VoiceProfile.1.Line.1.PhyReferenceList</Name><Value>2</Value></ParameterValueStruct><ParameterValueStruct><Name>InternetGatewayDevice.VoiceService.1.VoiceProfile.1.Line.1.SIP.AuthPassword</Name><Value>6Q73zu6k5hOL9TEM</Value></ParameterValueStruct></ParameterList><ParameterKey>20745</ParameterKey></cwmp:SetParameterValues></SOAP-ENV:Body></SOAP-ENV:Envelope>
<SOAP-ENV:Envelope xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="SOAP-ENV:Envelope"><SOAP-ENV:Header><cwmp:ID SOAP-ENV:mustUnderstand="1">1340799547556</cwmp:ID></SOAP-ENV:Header><SOAP-ENV:Body><cwmp:SetParameterValues><ParameterList SOAP-ENC:arrayType="cwmp:ParameterValueStruct[1]"><ParameterValueStruct><Name>InternetGatewayDevice.DeviceInfo.ProvisioningCode</Name><Value>H0V05-20120627141907-040519001209-172.30.150.142</Value></ParameterValueStruct></ParameterList><ParameterKey>20745</ParameterKey></cwmp:SetParameterValues></SOAP-ENV:Body></SOAP-ENV:Envelope>
